In [1]:
import sqlite3
import pandas as pd

In [2]:
conn=sqlite3.connect('data.db')

In [4]:
db = pd.read_csv('data/new_DisneylandReviews.csv')
db.to_sql('DB', conn)

D:\Program Files\Anaconda3\lib\site-packages\pandas\core\generic.py:2879: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [5]:
res = conn.execute("SELECT name FROM sqlite_master WHERE type = 'table';")

for name in res:
    print(name[0])

DB

In [ ]:
#!pip install ipython-sql

In [10]:
%load_ext sql

In [11]:
%sql sqlite:///data.db

## Write queries to return outputs

#### Get rows from table

In [14]:
%sql SELECT * FROM DB LIMIT 2;

 * sqlite:///data.db
Done.

[(0, 0, 670772142, 4, '2019-04-01', 'Australia', "If you've ever been to Disneyland anywhere you'll find Disneyland Hong Kong very similar in the layout when you walk into main street! It has a very  ... (31 characters truncated) ...   its a Small World  is absolutely fabulous and worth doing. The day we visited was fairly hot and relatively busy but the queues moved fairly well. ", 'HongKong', 2019, 4, 'Oceania'),
 (1, 1, 670682799, 4, '2019-05-01', 'Philippines', "Its been a while since d last time we visit HK Disneyland .. Yet, this time we only stay in Tomorrowland .. AKA Marvel land!Now they have Iron Man Ex ... (672 characters truncated) ... Street now have more attractive delicacies n Disney theme sweets .. These are Good Points!!Last, they also have Starbucks now inside the theme park!!", 'HongKong', 2019, 5, 'Asia')]

In [8]:
query = pd.read_sql_query("SELECT * FROM DB", conn)
query

,index,Unnamed: 0,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch,Year,Month,Continent
0,0,0,670772142,4,2019-04-01,Australia,If you've ever been to Disneyland anywhere you...,HongKong,2019,4,Oceania
1,1,1,670682799,4,2019-05-01,Philippines,Its been a while since d last time we visit HK...,HongKong,2019,5,Asia
2,2,2,670623270,4,2019-04-01,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,HongKong,2019,4,Asia
3,3,3,670607911,4,2019-04-01,Australia,HK Disneyland is a great compact park. Unfortu...,HongKong,2019,4,Oceania
4,4,4,670607296,4,2019-04-01,United Kingdom,"the location is not in the city, took around 1...",HongKong,2019,4,Europe
...,...,...,...,...,...,...,...,...,...,...,...
42639,42639,42651,1765031,5,2018-11-01,United Kingdom,i went to disneyland paris in july 03 and thou...,Paris,2018,11,Europe
42640,42640,42652,1659553,5,2014-10-01,Canada,2 adults and 1 child of 11 visited Disneyland ...,Paris,2014,10,North America
42641,42641,42653,1645894,5,2014-03-01,South Africa,My eleven year old daughter and myself went to...,Paris,2014,3,Africa
42642,42642,42654,1618637,4,2012-04-01,United States,"This hotel, part of the Disneyland Paris compl...",Paris,2012,4,North America
42643,42643,42655,1536786,4,2015-09-01,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Paris,2015,9,Europe

#### Get the name of each Disneyland branch

In [25]:
%sql SELECT DISTINCT(Branch) FROM DB;

 * sqlite:///data.db
Done.

[('HongKong',), ('California',), ('Paris',)]

#### Get number of reviews of each Disneyland branch

In [24]:
%sql SELECT Branch, COUNT(*) FROM DB GROUP BY Branch;

 * sqlite:///data.db
Done.

[('California', 19404), ('HongKong', 9611), ('Paris', 13629)]

#### Get number of top rating(5) reviews

In [15]:
%sql SELECT COUNT(*) FROM DB WHERE Rating = '5';

 * sqlite:///data.db
Done.

[(23140,)]

#### Get number of low rating(1) reviews

In [16]:
%sql SELECT COUNT(*) FROM DB WHERE Rating = '1';

 * sqlite:///data.db
Done.

[(1499,)]

#### Get the number of top rating from each Disneyland branch

In [29]:
%sql SELECT Branch, Rating, COUNT(*) FROM DB WHERE Rating = 5 GROUP BY Branch;

 * sqlite:///data.db
Done.

[('California', 5, 12517), ('HongKong', 5, 4513), ('Paris', 5, 6110)]

#### Get the number of rating from each Disneyland branch, ordered by the different ratings

In [38]:
%sql SELECT Branch, Rating, COUNT(*) FROM DB WHERE Branch = 'Paris' GROUP BY Rating ORDER BY Rating;

 * sqlite:///data.db
Done.

[('Paris', 1, 828),
 ('Paris', 2, 1044),
 ('Paris', 3, 2083),
 ('Paris', 4, 3564),
 ('Paris', 5, 6110)]

In [42]:
%sql SELECT Branch, Rating, COUNT(*) FROM DB WHERE Branch = 'HongKong' GROUP BY Rating ORDER BY Rating;

 * sqlite:///data.db
Done.

[('HongKong', 1, 172),
 ('HongKong', 2, 336),
 ('HongKong', 3, 1363),
 ('HongKong', 4, 3227),
 ('HongKong', 5, 4513)]

In [40]:
%sql SELECT Branch, Rating, COUNT(*) FROM DB WHERE Branch = 'California' GROUP BY Rating ORDER BY Rating;

 * sqlite:///data.db
Done.

[('California', 1, 499),
 ('California', 2, 747),
 ('California', 3, 1661),
 ('California', 4, 3980),
 ('California', 5, 12517)]

#### Get the average rating

In [17]:
%sql SELECT AVG(Rating) FROM DB;

 * sqlite:///data.db
Done.

[(4.217662508207485,)]

#### Get the average rating of each Disneyland branches

In [22]:
%sql SELECT Branch, AVG(Rating) FROM DB GROUP BY Branch;

 * sqlite:///data.db
Done.

[('California', 4.405328798185941),
 ('HongKong', 4.204141088336281),
 ('Paris', 3.9600117396727565)]

#### Get the total number of reviews for each month in descending order

In [49]:
%sql SELECT Month, COUNT(*) FROM DB GROUP BY Month ORDER BY COUNT(*) DESC

 * sqlite:///data.db
Done.

[(8, 4238),
 (7, 4082),
 (12, 4074),
 (10, 3981),
 (6, 3791),
 (4, 3717),
 (5, 3645),
 (9, 3442),
 (3, 3339),
 (11, 2912),
 (1, 2730),
 (2, 2693)]

#### Get the month with the highest number of reviewers for each branch

In [76]:
%sql SELECT Branch, Month, COUNT(*) FROM DB WHERE Branch = 'California' GROUP BY Month ORDER BY COUNT(*) DESC LIMIT 1;

 * sqlite:///data.db
Done.

[('California', 7, 1937)]

In [77]:
%sql SELECT Branch, Month, COUNT(*) FROM DB WHERE Branch = 'HongKong' GROUP BY Month ORDER BY COUNT(*) DESC LIMIT 1;

 * sqlite:///data.db
Done.

[('HongKong', 12, 1174)]

In [78]:
%sql SELECT Branch, Month, COUNT(*) FROM DB WHERE Branch = 'Paris' GROUP BY Month ORDER BY COUNT(*) DESC LIMIT 1;

 * sqlite:///data.db
Done.

[('Paris', 8, 1784)]

#### Get the year with the highest number of reviewers for each branch

In [83]:
%sql SELECT Branch, Year, COUNT(*) FROM DB WHERE Branch = 'California' GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1;

 * sqlite:///data.db
Done.

[('California', 2015, 3352)]

In [84]:
%sql SELECT Branch, Year, COUNT(*) FROM DB WHERE Branch = 'HongKong' GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1;

 * sqlite:///data.db
Done.

[('HongKong', 2016, 1886)]

In [85]:
%sql SELECT Branch, Year, COUNT(*) FROM DB WHERE Branch = 'Paris' GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1;

 * sqlite:///data.db
Done.

[('Paris', 2015, 2253)]

#### Get the region where the reviewers are from

In [86]:
%sql SELECT DISTINCT(Continent) FROM DB;

 * sqlite:///data.db
Done.

[('Oceania',),
 ('Asia',),
 ('Europe',),
 ('North America',),
 ('Africa',),
 ('South America',),
 ('EU',),
 ('None',)]

#### Get the number of reviewers for each continent

In [89]:
%sql SELECT Continent, COUNT(*) FROM DB GROUP BY Continent ORDER BY COUNT(*) DESC;

 * sqlite:///data.db
Done.

[('North America', 16977),
 ('Europe', 11734),
 ('Asia', 7007),
 ('Oceania', 5470),
 ('EU', 817),
 ('Africa', 446),
 ('South America', 184),
 ('None', 9)]

#### Get the countries of the reviewers from the region 'None' and show how many comes from each country

In [92]:
%sql SELECT Reviewer_Location AS Country, COUNT(*) AS Total FROM DB WHERE Continent = 'None' GROUP BY Country;

 * sqlite:///data.db
Done.

[('Caribbean Netherlands', 1),
 ('The Bahamas', 2),
 ('Timor-Leste', 1),
 ('U.S. Virgin Islands', 5)]

#### Get the region where most of the reviewers come from for each Disneyland branch

In [136]:
%%sql 
SELECT Branch, Continent, Count(*) AS Total, 
(COUNT(*)*1.0/(SELECT COUNT(*) FROM DB)*1.0)*100.0 AS Percent
FROM DB 
GROUP BY Branch, Continent 
ORDER BY Count(Continent) DESC;

 * sqlite:///data.db
Done.

[('California', 'North America', 14329, 33.60144451739987),
 ('Paris', 'Europe', 9437, 22.1297251664947),
 ('HongKong', 'Asia', 5386, 12.630147265734923),
 ('California', 'Oceania', 2993, 7.018572366569741),
 ('HongKong', 'Oceania', 1818, 4.263202326235812),
 ('Paris', 'North America', 1550, 3.6347434574617767),
 ('California', 'Europe', 1275, 2.989869618234687),
 ('HongKong', 'North America', 1098, 2.5748053653503424),
 ('Paris', 'Asia', 1048, 2.4575555763999626),
 ('HongKong', 'Europe', 1022, 2.396585686145765),
 ('Paris', 'EU', 678, 1.5899071381671515),
 ('Paris', 'Oceania', 659, 1.545352218366007),
 ('California', 'Asia', 573, 1.3436825813713535),
 ('HongKong', 'Africa', 192, 0.45023918956945874),
 ('Paris', 'Africa', 191, 0.4478941937904512),
 ('California', 'South America', 89, 0.20870462433167622),
 ('California', 'EU', 75, 0.17587468342556983),
 ('Paris', 'South America', 66, 0.15476972141450143),
 ('HongKong', 'EU', 64, 0.15007972985648627),
 ('California', 'Africa', 63, 0.14773473407747867),
 ('HongKong', 'South America', 29, 0.06800487759122034),
 ('California', 'None', 7, 0.016414970453053183),
 ('HongKong', 'None', 2, 0.004689991558015196)]